In [1]:
# 02
import pandas as pd

In [3]:
data = pd.read_csv('https://raw.githubusercontent.com/Pankaj-Str/Complete-Python-Mastery/refs/heads/main/00%20Lecture/lecture14/29%20Oct%202025/credit_card_transactions.csv')
print(data.head())

   Transaction_ID  Customer_ID Transaction_Date Transaction_Type Merchant  \
0          100000         4452       2023-01-01           Online  Walmart
1          100001         2775       2023-01-01              ATM  BestBuy
2          100002         2259       2023-01-01   Mobile Payment     Uber
3          100003         4545       2023-01-01           Online  BestBuy
4          100004         2137       2023-01-01              ATM   Amazon

   Category   Amount Payment_Mode Transaction_Status       Location
0    Travel  4520.70   Debit Card           Approved      Jonesport
1    Travel  1437.85   Debit Card           Approved  Port Jennifer
2  Clothing  3320.52       PayPal           Approved     Port James
3    Travel  2659.96   Debit Card           Approved     Hawkinston
4    Travel  2517.07   Debit Card           Approved    Matthewland

In [4]:
# adding and modify data

data1 = {
        'Name':['Tushar', 'vaibhav', 'tisha', 'kavya','Deep','sushant'],
        'Age':[22,21,20,22,23,24],
        'City':['Mumbai',' Goa', 'Gujrat', 'Tamil nadu', 'Delhi', 'Hydrebad']
}
print(data1)

{'Name': ['Tushar', 'vaibhav', 'tisha', 'kavya', 'Deep', 'sushant'], 'Age': [22, 21, 20, 22, 23, 24], 'City': ['Mumbai', ' Goa', 'Gujrat', 'Tamil nadu', 'Delhi', 'Hydrebad']}

In [19]:
df = pd.DataFrame(data1)
df

      Name  Age        City
0   Tushar   22      Mumbai
1  vaibhav   21         Goa
2    tisha   20      Gujrat
3    kavya   22  Tamil nadu
4     Deep   23       Delhi
5  sushant   24    Hydrebad

In [20]:
# add new column salary

df['salary'] = [5000,1000,2000,3000,4500,1500]
print(df)

      Name  Age        City  salary
0   Tushar   22      Mumbai    5000
1  vaibhav   21         Goa    1000
2    tisha   20      Gujrat    2000
3    kavya   22  Tamil nadu    3000
4     Deep   23       Delhi    4500
5  sushant   24    Hydrebad    1500

In [17]:
# modify exixting column # age + 2

df['Age'] = df['Age'] +2      #(age 22 + 2 = 24)
print(df)

      Name  Age        City  salary
0   Tushar   28      Mumbai    5000
1  vaibhav   27         Goa    1000
2    tisha   26      Gujrat    2000
3    kavya   28  Tamil nadu    3000
4     Deep   29       Delhi    4500
5  sushant   30    Hydrebad    1500
6      Roy   30     Haryana    2500
7      Roy   30     Haryana    2500
8      Roy   28     Haryana    2500

In [24]:
# add new row
import numpy as np
new_row1 = {'Name':'None', 'Age':26, 'City': 'Haryana', 'salary': np.nan}
row1 = pd.DataFrame([new_row1])         # add row in list
df = pd.concat([df, row1],  ignore_index = True)
print(df)

      Name  Age        City  salary
0   Tushar   22      Mumbai  5000.0
1  vaibhav   21         Goa  1000.0
2    tisha   20      Gujrat  2000.0
3    kavya   22  Tamil nadu  3000.0
4     Deep   23       Delhi  4500.0
5  sushant   24    Hydrebad  1500.0
6     None   26     Haryana     NaN
7     None   26     Haryana     NaN
8     None   26     Haryana     NaN

In [25]:
#handling missingh data

# 1 identify null values
df.isnull().sum()

Name      0
Age       0
City      0
salary    3
dtype: int64

In [29]:
# delete row 
df = df.dropna()
print(df)

      Name  Age        City  salary
0   Tushar   22      Mumbai  5000.0
1  vaibhav   21         Goa  1000.0
2    tisha   20      Gujrat  2000.0
3    kavya   22  Tamil nadu  3000.0
4     Deep   23       Delhi  4500.0
5  sushant   24    Hydrebad  1500.0

In [31]:
df.isnull().sum()

Name      0
Age       0
City      0
salary    0
dtype: int64

In [66]:
# how to add values in nan=data
new_row1 = {'Name':None, 'Age':26, 'City': 'pakistan', 'salary': np.nan}
row1 = pd.DataFrame([new_row1])         # add row in list
df = pd.concat([df, row1],  ignore_index = True)
print(df)

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14     None   26    pakistan     NaN

In [67]:
# fill value
df['Age'].fillna(df['Age'].mean())
print(df)

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14     None   26    pakistan     NaN

In [68]:
df['salary'] = df['salary'].fillna(100)
df

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14     None   26    pakistan   100.0

In [69]:
df['Name'] = df['Name'].fillna('kalluwa')
df

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14  kalluwa   26    pakistan   100.0

In [62]:
df.isnull().sum()

Name      0
Age       0
City      0
salary    0
dtype: int64

In [74]:
# remove all duplicatess values

df_clean = df.drop_duplicates()
df_clean

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
10     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0

In [77]:
df_subset = df.drop_duplicates(subset=['Name'],)
print(df_subset)

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
13  kalluwa   26    pakistan   100.0

In [79]:
# duplicates(es)- delete the value
# duplicated(ed) - find the total  duplicate presented (false = unique values  / True = duplicated values are present)

# find the duplicated
duplicated = df.duplicated()
print(duplicated)

# find total duplicated
total_duplicated = df.duplicated().sum()
print(total_duplicated)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10    False
11     True
12     True
13    False
14     True
dtype: bool
6

In [78]:
# reset Index 
# df = df.drop_duplicates().reset_index(drop=True)
df_subset = df.drop_duplicates(subset=['Name'],ignore_index = True)
print(df_subset)

      Name  Age        City  salary
0   Tushar   22      Mumbai  5000.0
1  vaibhav   21         Goa  1000.0
2    tisha   20      Gujrat  2000.0
3    kavya   22  Tamil nadu  3000.0
4     Deep   23       Delhi  4500.0
5  sushant   24    Hydrebad  1500.0
6     None   26    pakistan     0.0
7  kalluwa   26    pakistan   100.0

In [82]:
# sorting the dataframe

ascending_order = df.sort_values(by = 'Age')
print(ascending_order)

       Name  Age        City  salary
2     tisha   20      Gujrat  2000.0
1   vaibhav   21         Goa  1000.0
0    Tushar   22      Mumbai  5000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14  kalluwa   26    pakistan   100.0

In [87]:
# sorting multiple columns 

d = df.sort_values(by = ['City','Age'])
print(d)

       Name  Age        City  salary
1   vaibhav   21         Goa  1000.0
4      Deep   23       Delhi  4500.0
2     tisha   20      Gujrat  2000.0
5   sushant   24    Hydrebad  1500.0
0    Tushar   22      Mumbai  5000.0
3     kavya   22  Tamil nadu  3000.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14  kalluwa   26    pakistan   100.0

In [84]:
desending_order = df.sort_values(by='Age' , ascending = False)
print(desending_order)

       Name  Age        City  salary
6      None   26    pakistan     0.0
12     None   26    pakistan   100.0
11     None   26    pakistan   100.0
10     None   26    pakistan   100.0
9      None   26    pakistan     0.0
8      None   26    pakistan     0.0
7      None   26    pakistan     0.0
13  kalluwa   26    pakistan   100.0
14  kalluwa   26    pakistan   100.0
5   sushant   24    Hydrebad  1500.0
4      Deep   23       Delhi  4500.0
3     kavya   22  Tamil nadu  3000.0
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0

In [93]:
# Grouping

#add new data
new_row1 = {'Name':'Sidhi', 'Age':22, 'City': 'Goa ', 'salary': 500}
row1 = pd.DataFrame([new_row1])         # add row in list
df = pd.concat([df, row1],  ignore_index = True)
print(df)

       Name  Age        City  salary
0    Tushar   22      Mumbai  5000.0
1   vaibhav   21         Goa  1000.0
2     tisha   20      Gujrat  2000.0
3     kavya   22  Tamil nadu  3000.0
4      Deep   23       Delhi  4500.0
5   sushant   24    Hydrebad  1500.0
6      None   26    pakistan     0.0
7      None   26    pakistan     0.0
8      None   26    pakistan     0.0
9      None   26    pakistan     0.0
10     None   26    pakistan   100.0
11     None   26    pakistan   100.0
12     None   26    pakistan   100.0
13  kalluwa   26    pakistan   100.0
14  kalluwa   26    pakistan   100.0
15    Rohan   26       Delhi     NaN
16    Mohan   26       Delhi     NaN
17    sohan   26     Mumbai      NaN
18    ridhi   20     Mumbai   5050.0
19    Sidhi   22        Goa    500.0
20    Sidhi   22        Goa    500.0

In [99]:
# Grouping data and aggregation
# group by city

grouped = df.groupby('City').sum()
print(grouped)
print('--------------------------------------------------------')

grouped = df.groupby('City').size()
print(grouped)

print('----------------------------------------------------------')

# find min and max salary
age_stats = df.groupby('City')['salary'].agg(['max','min'])
print(age_stats)

                                                  Name  Age  salary
City
 Goa                                           vaibhav   21  1000.0
Delhi                                   DeepRohanMohan   75  4500.0
Goa                                         SidhiSidhi   44  1000.0
Gujrat                                           tisha   20  2000.0
Hydrebad                                       sushant   24  1500.0
Mumbai                                          Tushar   22  5000.0
Mumbai                                      sohanridhi   46  5050.0
Tamil nadu                                       kavya   22  3000.0
pakistan    NoneNoneNoneNoneNoneNoneNonekalluwakalluwa  234   500.0
--------------------------------------------------------
City
 Goa          1
Delhi         3
Goa           2
Gujrat        1
Hydrebad      1
Mumbai        1
Mumbai        2
Tamil nadu    1
pakistan      9
dtype: int64
----------------------------------------------------------
               max     min
City
 Goa        1000.0  1000.0
Delhi       4500.0  4500.0
Goa          500.0   500.0
Gujrat      2000.0  2000.0
Hydrebad    1500.0  1500.0
Mumbai      5000.0  5000.0
Mumbai      5050.0  5050.0
Tamil nadu  3000.0  3000.0
pakistan     100.0     0.0